package com.riq.swiperefreshlayout;

import java.util.List;

@SuppressWarnings("all")
public class Joke {
    /**
     * showapi_res_code : 0
     * showapi_res_error :
     * showapi_res_body : {"allPages":695,"ret_code":0,"contentlist":[{"id":"58e89ac06e3630479295d552","title":"\u201c同学们，今天我们要...","text":"\u201c同学们，今天我们要讲的这个成语叫\u2018喜怒无常\u2019。。。\r\n哈哈哈哈哈哈哈哈哈！\r\n操！他妈的都给我去操场跑十圈！\u201d","type":1,"ct":"2017-04-08 16:09:36.813"},{"id":"58e89ac06e3630479295d54d","title":"中午去上厕所回来的时...","text":"中午去上厕所回来的时候，\r\n保洁阿姨很热情地和我打招呼：\u201c吃完啦？\u201d\r\n我忍着内心巨大的无奈点了点头，微笑着说：\u201c吃完了。。\u201d","type":1,"ct":"2017-04-08 16:09:36.792"},{"id":"58e89ac06e3630479295d54c","title":"儿子的幼儿园要拍童话...","text":"儿子的幼儿园要拍童话剧。\r\n老师说要给儿子安排一个独一无二万众瞩目的角色，\r\n结果安排的是《小兔子拔萝卜》里那个萝卜，压根不让露脸。\r\n儿子明显不开心了，我就劝他：\r\n\u201c明天上台，小兔子上来拔你第一下的时候你就让她把你给拔出来。\u201d","type":1,"ct":"2017-04-08 16:09:36.780"},{"id":"58e891cc6e3630479295a3b5","title":"法官：\u201c你为什么把你...","text":"法官：\u201c你为什么把你的太太从三楼推了下去？\u201d\r\n被告：\u201c以前我们住在一楼，我忘了我们搬家了。。。。。。\u201d","type":1,"ct":"2017-04-08 15:31:24.095"},{"id":"58e891cc6e3630479295a3b4","title":"手术室门口，大汗淋漓...","text":"手术室门口，大汗淋漓、浑身湿透的医生对家属说：\u201c对不起，我们尽力了！\u201d\r\n家属闻言哭成泪人：\u201c真的\u2026\u2026真的一点办法都没有了吗？\u201d\r\n医生摇摇头，叹道：\u201c你女儿实在太胖了，我们真的搬不上手术台。\u201d","type":1,"ct":"2017-04-08 15:31:24.091"},{"id":"58e883a06e36304792956a44","title":"我的前任是一个做作的...","text":"我的前任是一个做作的女孩，非说自己对各种辐射感应超明显。。\r\n有一次我开蓝牙传图片，她看到了，居然痛苦的捂着胸口和我说：\u201c你是不是把蓝牙开了，快关掉，我难受。\u201d","type":1,"ct":"2017-04-08 14:30:56.814"},{"id":"58e875d76e36304792953a54","title":"每次读这首诗的时候，...","text":"每次读这首诗的时候，总会在\u201c遥想公瑾当年，小乔初嫁了，雄姿英发，羽扇纶巾，谈笑间，樯橹灰飞烟灭\u201d这一句上思考好久，好像另有深意\u2026\u2026","type":1,"ct":"2017-04-08 13:32:07.269"},{"id":"58e875d76e36304792953a48","title":"一哥们去算命说：\u201c大...","text":"一哥们去算命说：\u201c大师，我昨晚梦见嘴里上面这排牙全掉光了。\u201d\r\n大师卜了一挂，说：\u201c别担心，梦是反的！\u201d\r\n那哥们问：\u201c那这意味着什么？\u201d\r\n大师幽幽地道：\u201c那意味着你下面那排牙会掉光。\u201d","type":1,"ct":"2017-04-08 13:32:07.106"},{"id":"58e870046e36304792952788","title":"什么叫有个性？什么叫...","text":"什么叫有个性？什么叫脾气大？\r\n我哥们睡觉翻身的时候从床上掉下来了，然后就怒了，\r\n哐哐给自己俩大嘴巴子然后上床接着睡。","type":1,"ct":"2017-04-08 13:07:16.453"},{"id":"58e861986e3630479294eb9b","title":"有次和同事一起去买烟...","text":"有次和同事一起去买烟，我顺手拿了旁边的杜蕾s看了一下，朋友突然来句：\u201c要买吗？\u201d\r\n我脑抽的回了一句：\u201c和你用吖！？\u201d\r\n我以为这就结束了，没想到这货伸出兰花指，特妖艳的姿势，特嗲声嗲气的语气说：\u201c人家不喜欢用TT嘛。\u201d\r\n当时递烟给我那大姐的眼神，明显的充满恐惧与鄙视啊！","type":1,"ct":"2017-04-08 12:05:44.487"},{"id":"58e859ab6e3630479294bbb1","title":"站在超市的立式冰柜前...","text":"站在超市的立式冰柜前看了好久，男朋友问我：\u201c想喝什么？\u201d\r\n我说：\u201c长胖不喝。\u201d\r\n他：\u201c哦。\u201d\r\n然后我还站着，他：\u201c实在想喝就买。\u201d\r\n我：\u201c不喝不喝。\u201d我继续站着。\r\n他就过来开门：\u201c买买买，喝哪个？\u201d\r\n我：\u201c不喝。\u201d\r\n他超无奈的关上门：\u201c不喝那你站着干嘛，走啊。\u201d\r\n我：\u201c哦，我只是看看我的腿是不是很粗。\u201d","type":1,"ct":"2017-04-08 11:31:55.292"},{"id":"58e8541d6e3630479294b29d","title":"昨晚去女同事家吃饭，...","text":"昨晚去女同事家吃饭，她妈表现地极度热情，一直夸自己的女儿多孝顺、多懂事、多持家，说要是谁娶了她女儿绝对好福气，末了突然话锋一转，问我：\u201c天太晚了，你要不就在这过夜吧？\u201d我听着耳畔传来的《新闻联播》片头曲不禁陷入沉思。","type":1,"ct":"2017-04-08 11:08:13.278"},{"id":"58e846466e36304792947656","title":"\u201c你一个女孩子要小心...","text":"\u201c你一个女孩子要小心点啊！走夜路不安全万一被歹人劫色怎么办！\u201d\r\n\u201c你就放心吧，我不会轻易被上的。\u201d\r\n\u201c啊？为什么？\u201d\r\n\u201c因为爱情。\u201d","type":1,"ct":"2017-04-08 10:09:10.428"},{"id":"58e83dfa6e36304792945050","title":"在火车站，一下车，就...","text":"在火车站，一下车，就有一大妈上前：兄弟，住旅社吗？\r\n我说：不住。\r\n大妈神秘地说：有小姑娘哟，漂亮的小姑娘。\r\n我：不要小姑娘。\r\n大妈赶紧说：老姑娘也有，就是价钱便宜点。\r\n我哭笑不得：不要姑娘。\r\n大妈沉默了一下，幽幽的说：那个，小伙子也有。","type":1,"ct":"2017-04-08 09:33:46.202"},{"id":"58e83dfa6e3630479294504f","title":"高中宿舍有一哥们，习...","text":"高中宿舍有一哥们，习惯睡觉就穿一内裤。\r\n一次买了一条重点部位是蜘蛛图案的内裤，关键是图案半夜会有夜光的，各种和我们炫耀。\r\n半夜睡觉依旧只穿一内裤，宿管大叔查房看到那蜘蛛，脑子一抽二话没说一棍子抽上去了\u2026\r\n据说这孩子连续夹着腿走路了三天 \r\n","type":1,"ct":"2017-04-08 09:33:46.164"},{"id":"58e83dfa6e3630479294504e","title":"和媳妇吵架，差点动手...","text":"和媳妇吵架，差点动手了。\r\n晚上我躺着生闷气，媳妇说道：过来！\r\n我当时就火了，好歹我也是七尺男儿，也是有血性的，于是我回道：滚！\r\n媳妇：我再问你一次，过不过来！！\r\n我：滚，别烦我！\r\n心里想着绝不能轻易屈服！\r\n媳妇：行，你厉害，你下半辈子就在床下躺着，别出来！","type":1,"ct":"2017-04-08 09:33:46.033"},{"id":"58e83df96e3630479294504d","title":"坐火车，对面一对小情...","text":"坐火车，对面一对小情侣，各种斗嘴和秀恩爱。终于累了，靠一起睡。后来男的上厕所去，女的揉揉眼，掰桔子吃，忽然自己笑，把桌上的可乐拿来，拧开盖，硬塞了2片桔子进去。我目瞪口呆。她自己还很开心，对我眨眨眼，又捂嘴笑。你娇羞个头啊！你男朋友那瓶在他自己包里啊，桌上那瓶是我的！","type":1,"ct":"2017-04-08 09:33:45.845"},{"id":"58e83df96e3630479294504c","title":"他说：反应快慢很容易...","text":"他说：反应快慢很容易测试，比如听到一个成语，\r\n立刻就能说出第2个字和第3个字，反应就算快。 \r\n她说：你讲一个。 \r\n他说：一国两制！\r\n她说：\u2026国两。 \r\n他说：哈哈哈好慢。\r\n她不服气，说：再来。 \r\n他说：\u201c走马上任！\u201d\u201c马上！\r\n卿卿我我！\u201d\u201c亲我！\u201d\r\n然后他没等她反应过来就嘟嘴扑了过去\u2026\u2026","type":1,"ct":"2017-04-08 09:33:45.844"},{"id":"58e82f266e36304792940d7e","title":"约暗恋的妹子出来逛街...","text":"约暗恋的妹子出来逛街，她说：\u201c不行，老爸在家，没人陪。要不你来我家吧？\u201d\r\n这是要见家长的节奏啊，我赶紧的提了两瓶酒去了。。。\r\n刚坐下，妹子对她爸说：\u201c你要的人我给你找来了，我陪我男朋友逛街去了。。。\u201d","type":1,"ct":"2017-04-08 08:30:30.695"},{"id":"58e749036e3630479290d226","title":"最近认识了一个妹妹，...","text":"最近认识了一个妹妹，多次暗示说想和我谈恋爱试一试，我昨天翻看了下近期日历，我发现双十一，双十二，平安夜，元旦，情人节，背后一冷\u2026\u2026","type":1,"ct":"2017-04-07 16:08:35.263"}],"currentPage":1,"allNum":13888,"maxResult":20}
     */

    private int showapi_res_code;
    private String showapi_res_error;
    private ShowapiResBodyBean showapi_res_body;

    public int getShowapi_res_code() {
        return showapi_res_code;
    }

    public void setShowapi_res_code(int showapi_res_code) {
        this.showapi_res_code = showapi_res_code;
    }

    public String getShowapi_res_error() {
        return showapi_res_error;
    }

    public void setShowapi_res_error(String showapi_res_error) {
        this.showapi_res_error = showapi_res_error;
    }

    public ShowapiResBodyBean getShowapi_res_body() {
        return showapi_res_body;
    }

    public void setShowapi_res_body(ShowapiResBodyBean showapi_res_body) {
        this.showapi_res_body = showapi_res_body;
    }

    public static class ShowapiResBodyBean {
        /**
         * allPages : 695
         * ret_code : 0
         * contentlist : [{"id":"58e89ac06e3630479295d552","title":"\u201c同学们，今天我们要...","text":"\u201c同学们，今天我们要讲的这个成语叫\u2018喜怒无常\u2019。。。\r\n哈哈哈哈哈哈哈哈哈！\r\n操！他妈的都给我去操场跑十圈！\u201d","type":1,"ct":"2017-04-08 16:09:36.813"},{"id":"58e89ac06e3630479295d54d","title":"中午去上厕所回来的时...","text":"中午去上厕所回来的时候，\r\n保洁阿姨很热情地和我打招呼：\u201c吃完啦？\u201d\r\n我忍着内心巨大的无奈点了点头，微笑着说：\u201c吃完了。。\u201d","type":1,"ct":"2017-04-08 16:09:36.792"},{"id":"58e89ac06e3630479295d54c","title":"儿子的幼儿园要拍童话...","text":"儿子的幼儿园要拍童话剧。\r\n老师说要给儿子安排一个独一无二万众瞩目的角色，\r\n结果安排的是《小兔子拔萝卜》里那个萝卜，压根不让露脸。\r\n儿子明显不开心了，我就劝他：\r\n\u201c明天上台，小兔子上来拔你第一下的时候你就让她把你给拔出来。\u201d","type":1,"ct":"2017-04-08 16:09:36.780"},{"id":"58e891cc6e3630479295a3b5","title":"法官：\u201c你为什么把你...","text":"法官：\u201c你为什么把你的太太从三楼推了下去？\u201d\r\n被告：\u201c以前我们住在一楼，我忘了我们搬家了。。。。。。\u201d","type":1,"ct":"2017-04-08 15:31:24.095"},{"id":"58e891cc6e3630479295a3b4","title":"手术室门口，大汗淋漓...","text":"手术室门口，大汗淋漓、浑身湿透的医生对家属说：\u201c对不起，我们尽力了！\u201d\r\n家属闻言哭成泪人：\u201c真的\u2026\u2026真的一点办法都没有了吗？\u201d\r\n医生摇摇头，叹道：\u201c你女儿实在太胖了，我们真的搬不上手术台。\u201d","type":1,"ct":"2017-04-08 15:31:24.091"},{"id":"58e883a06e36304792956a44","title":"我的前任是一个做作的...","text":"我的前任是一个做作的女孩，非说自己对各种辐射感应超明显。。\r\n有一次我开蓝牙传图片，她看到了，居然痛苦的捂着胸口和我说：\u201c你是不是把蓝牙开了，快关掉，我难受。\u201d","type":1,"ct":"2017-04-08 14:30:56.814"},{"id":"58e875d76e36304792953a54","title":"每次读这首诗的时候，...","text":"每次读这首诗的时候，总会在\u201c遥想公瑾当年，小乔初嫁了，雄姿英发，羽扇纶巾，谈笑间，樯橹灰飞烟灭\u201d这一句上思考好久，好像另有深意\u2026\u2026","type":1,"ct":"2017-04-08 13:32:07.269"},{"id":"58e875d76e36304792953a48","title":"一哥们去算命说：\u201c大...","text":"一哥们去算命说：\u201c大师，我昨晚梦见嘴里上面这排牙全掉光了。\u201d\r\n大师卜了一挂，说：\u201c别担心，梦是反的！\u201d\r\n那哥们问：\u201c那这意味着什么？\u201d\r\n大师幽幽地道：\u201c那意味着你下面那排牙会掉光。\u201d","type":1,"ct":"2017-04-08 13:32:07.106"},{"id":"58e870046e36304792952788","title":"什么叫有个性？什么叫...","text":"什么叫有个性？什么叫脾气大？\r\n我哥们睡觉翻身的时候从床上掉下来了，然后就怒了，\r\n哐哐给自己俩大嘴巴子然后上床接着睡。","type":1,"ct":"2017-04-08 13:07:16.453"},{"id":"58e861986e3630479294eb9b","title":"有次和同事一起去买烟...","text":"有次和同事一起去买烟，我顺手拿了旁边的杜蕾s看了一下，朋友突然来句：\u201c要买吗？\u201d\r\n我脑抽的回了一句：\u201c和你用吖！？\u201d\r\n我以为这就结束了，没想到这货伸出兰花指，特妖艳的姿势，特嗲声嗲气的语气说：\u201c人家不喜欢用TT嘛。\u201d\r\n当时递烟给我那大姐的眼神，明显的充满恐惧与鄙视啊！","type":1,"ct":"2017-04-08 12:05:44.487"},{"id":"58e859ab6e3630479294bbb1","title":"站在超市的立式冰柜前...","text":"站在超市的立式冰柜前看了好久，男朋友问我：\u201c想喝什么？\u201d\r\n我说：\u201c长胖不喝。\u201d\r\n他：\u201c哦。\u201d\r\n然后我还站着，他：\u201c实在想喝就买。\u201d\r\n我：\u201c不喝不喝。\u201d我继续站着。\r\n他就过来开门：\u201c买买买，喝哪个？\u201d\r\n我：\u201c不喝。\u201d\r\n他超无奈的关上门：\u201c不喝那你站着干嘛，走啊。\u201d\r\n我：\u201c哦，我只是看看我的腿是不是很粗。\u201d","type":1,"ct":"2017-04-08 11:31:55.292"},{"id":"58e8541d6e3630479294b29d","title":"昨晚去女同事家吃饭，...","text":"昨晚去女同事家吃饭，她妈表现地极度热情，一直夸自己的女儿多孝顺、多懂事、多持家，说要是谁娶了她女儿绝对好福气，末了突然话锋一转，问我：\u201c天太晚了，你要不就在这过夜吧？\u201d我听着耳畔传来的《新闻联播》片头曲不禁陷入沉思。","type":1,"ct":"2017-04-08 11:08:13.278"},{"id":"58e846466e36304792947656","title":"\u201c你一个女孩子要小心...","text":"\u201c你一个女孩子要小心点啊！走夜路不安全万一被歹人劫色怎么办！\u201d\r\n\u201c你就放心吧，我不会轻易被上的。\u201d\r\n\u201c啊？为什么？\u201d\r\n\u201c因为爱情。\u201d","type":1,"ct":"2017-04-08 10:09:10.428"},{"id":"58e83dfa6e36304792945050","title":"在火车站，一下车，就...","text":"在火车站，一下车，就有一大妈上前：兄弟，住旅社吗？\r\n我说：不住。\r\n大妈神秘地说：有小姑娘哟，漂亮的小姑娘。\r\n我：不要小姑娘。\r\n大妈赶紧说：老姑娘也有，就是价钱便宜点。\r\n我哭笑不得：不要姑娘。\r\n大妈沉默了一下，幽幽的说：那个，小伙子也有。","type":1,"ct":"2017-04-08 09:33:46.202"},{"id":"58e83dfa6e3630479294504f","title":"高中宿舍有一哥们，习...","text":"高中宿舍有一哥们，习惯睡觉就穿一内裤。\r\n一次买了一条重点部位是蜘蛛图案的内裤，关键是图案半夜会有夜光的，各种和我们炫耀。\r\n半夜睡觉依旧只穿一内裤，宿管大叔查房看到那蜘蛛，脑子一抽二话没说一棍子抽上去了\u2026\r\n据说这孩子连续夹着腿走路了三天 \r\n","type":1,"ct":"2017-04-08 09:33:46.164"},{"id":"58e83dfa6e3630479294504e","title":"和媳妇吵架，差点动手...","text":"和媳妇吵架，差点动手了。\r\n晚上我躺着生闷气，媳妇说道：过来！\r\n我当时就火了，好歹我也是七尺男儿，也是有血性的，于是我回道：滚！\r\n媳妇：我再问你一次，过不过来！！\r\n我：滚，别烦我！\r\n心里想着绝不能轻易屈服！\r\n媳妇：行，你厉害，你下半辈子就在床下躺着，别出来！","type":1,"ct":"2017-04-08 09:33:46.033"},{"id":"58e83df96e3630479294504d","title":"坐火车，对面一对小情...","text":"坐火车，对面一对小情侣，各种斗嘴和秀恩爱。终于累了，靠一起睡。后来男的上厕所去，女的揉揉眼，掰桔子吃，忽然自己笑，把桌上的可乐拿来，拧开盖，硬塞了2片桔子进去。我目瞪口呆。她自己还很开心，对我眨眨眼，又捂嘴笑。你娇羞个头啊！你男朋友那瓶在他自己包里啊，桌上那瓶是我的！","type":1,"ct":"2017-04-08 09:33:45.845"},{"id":"58e83df96e3630479294504c","title":"他说：反应快慢很容易...","text":"他说：反应快慢很容易测试，比如听到一个成语，\r\n立刻就能说出第2个字和第3个字，反应就算快。 \r\n她说：你讲一个。 \r\n他说：一国两制！\r\n她说：\u2026国两。 \r\n他说：哈哈哈好慢。\r\n她不服气，说：再来。 \r\n他说：\u201c走马上任！\u201d\u201c马上！\r\n卿卿我我！\u201d\u201c亲我！\u201d\r\n然后他没等她反应过来就嘟嘴扑了过去\u2026\u2026","type":1,"ct":"2017-04-08 09:33:45.844"},{"id":"58e82f266e36304792940d7e","title":"约暗恋的妹子出来逛街...","text":"约暗恋的妹子出来逛街，她说：\u201c不行，老爸在家，没人陪。要不你来我家吧？\u201d\r\n这是要见家长的节奏啊，我赶紧的提了两瓶酒去了。。。\r\n刚坐下，妹子对她爸说：\u201c你要的人我给你找来了，我陪我男朋友逛街去了。。。\u201d","type":1,"ct":"2017-04-08 08:30:30.695"},{"id":"58e749036e3630479290d226","title":"最近认识了一个妹妹，...","text":"最近认识了一个妹妹，多次暗示说想和我谈恋爱试一试，我昨天翻看了下近期日历，我发现双十一，双十二，平安夜，元旦，情人节，背后一冷\u2026\u2026","type":1,"ct":"2017-04-07 16:08:35.263"}]
         * currentPage : 1
         * allNum : 13888
         * maxResult : 20
         */

        private int allPages;
        private int ret_code;
        private int currentPage;
        private int allNum;
        private int maxResult;
        private List<ContentlistBean> contentlist;

        public int getAllPages() {
            return allPages;
        }

        public void setAllPages(int allPages) {
            this.allPages = allPages;
        }

        public int getRet_code() {
            return ret_code;
        }

        public void setRet_code(int ret_code) {
            this.ret_code = ret_code;
        }

        public int getCurrentPage() {
            return currentPage;
        }

        public void setCurrentPage(int currentPage) {
            this.currentPage = currentPage;
        }

        public int getAllNum() {
            return allNum;
        }

        public void setAllNum(int allNum) {
            this.allNum = allNum;
        }

        public int getMaxResult() {
            return maxResult;
        }

        public void setMaxResult(int maxResult) {
            this.maxResult = maxResult;
        }

        public List<ContentlistBean> getContentlist() {
            return contentlist;
        }

        public void setContentlist(List<ContentlistBean> contentlist) {
            this.contentlist = contentlist;
        }

        public static class ContentlistBean {
            /**
             * id : 58e89ac06e3630479295d552
             * title : “同学们，今天我们要...
             * text : “同学们，今天我们要讲的这个成语叫‘喜怒无常’。。。
             哈哈哈哈哈哈哈哈哈！
             操！他妈的都给我去操场跑十圈！”
             * type : 1
             * ct : 2017-04-08 16:09:36.813
             */

            private String id;
            private String title;
            private String text;
            private int type;
            private String ct;

            public String getId() {
                return id;
            }

            public void setId(String id) {
                this.id = id;
            }

            public String getTitle() {
                return title;
            }

            public void setTitle(String title) {
                this.title = title;
            }

            public String getText() {
                return text;
            }

            public void setText(String text) {
                this.text = text;
            }

            public int getType() {
                return type;
            }

            public void setType(int type) {
                this.type = type;
            }

            public String getCt() {
                return ct;
            }

            public void setCt(String ct) {
                this.ct = ct;
            }
        }
    }

}
